app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("credit_card_number", "credit_card_expires_on", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["credit_card_number", "4364208900437683"], ["credit_card_expires_on", Tue, 01 Jun 2021], ["created_at", 2017-01-12 03:09:20 UTC], ["updated_at", 2017-01-12 03:09:20 UTC]]

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "credit_card_number" = ?, "credit_card_expires_on" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["credit_card_number", "5364208900437684"], ["credit_card_expires_on", Wed, 01 Jun 2022], ["updated_at", 2017-01-12 03:13:29 UTC], ["id", 1]]